; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v8 - type_1 ?v3 - type_2)
 	      (pred_3 ?v4 - object ?v3 - type_2)
	      (pred_4 ?v8 - type_1 ?v2 - type_3)
	      (pred_1 ?v8 - type_1 ?v4 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v7 ?v1 - type_2)
       :precondition (and  (pred_2 ?v8 ?v7))
       :effect (and  (pred_2 ?v8 ?v1)
		     (not (pred_2 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v5) (pred_2 ?v8 ?v5) (pred_4 ?v8 ?v2))
       :effect (and (pred_1 ?v8 ?v6 ?v2)
		    (not (pred_3 ?v6 ?v5)) 
		    (not (pred_4 ?v8 ?v2))))

   (:action op_2
       :parameters (?v8 - type_1 ?v6 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v6 ?v2) (pred_2 ?v8 ?v5))
       :effect (and (pred_3 ?v6 ?v5)
		    (pred_4 ?v8 ?v2)
		    (not (pred_1 ?v8 ?v6 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_13 - type_1
obj_08 obj_01 obj_11 obj_06 - type_3
obj_10 obj_03 obj_05 obj_09 - type_2
obj_04 obj_12 obj_02 - object)
(:init
(pred_2 obj_07 obj_09)
(pred_4 obj_07 obj_08)
(pred_4 obj_07 obj_01)
(pred_2 obj_13 obj_09)
(pred_4 obj_13 obj_11)
(pred_4 obj_13 obj_06)
(pred_3 obj_04 obj_05)
(pred_3 obj_12 obj_10)
(pred_3 obj_02 obj_05)
)
(:goal
(and
(pred_3 obj_04 obj_09)
(pred_3 obj_12 obj_05)
(pred_3 obj_02 obj_10)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_05)))
)
)

; plan
1. (op_1 obj_13 obj_09 obj_10)
   deleted: (pred_2 obj_13 obj_09)
   added: (pred_2 obj_13 obj_10)
   goals met: 0 of 3
2. (op_3 obj_13 obj_12 obj_10 obj_06)
   deleted: (pred_3 obj_12 obj_10) (pred_4 obj_13 obj_06)
   added: (pred_1 obj_13 obj_12 obj_06)
   goals met: 0 of 3
3. (op_1 obj_13 obj_10 obj_05)
   deleted: (pred_2 obj_13 obj_10)
   added: (pred_2 obj_13 obj_05)
   goals met: 0 of 3
4. (op_2 obj_13 obj_12 obj_05 obj_06)
   deleted: (pred_1 obj_13 obj_12 obj_06)
   added: (pred_3 obj_12 obj_05) (pred_4 obj_13 obj_06)
   goals met: 1 of 3
5. (op_3 obj_13 obj_02 obj_05 obj_06)
   deleted: (pred_3 obj_02 obj_05) (pred_4 obj_13 obj_06)
   added: (pred_1 obj_13 obj_02 obj_06)
   goals met: 1 of 3
6. (op_1 obj_13 obj_05 obj_10)
   deleted: (pred_2 obj_13 obj_05)
   added: (pred_2 obj_13 obj_10)
   goals met: 1 of 3
7. (op_2 obj_13 obj_02 obj_10 obj_06)
   deleted: (pred_1 obj_13 obj_02 obj_06)
   added: (pred_3 obj_02 obj_10) (pred_4 obj_13 obj_06)
   goals met: 2 of 3
8. (op_1 obj_13 obj_10 obj_05)
   deleted: (pred_2 obj_13 obj_10)
   added: (pred_2 obj_13 obj_05)
   goals met: 2 of 3
9. (op_3 obj_13 obj_04 obj_05 obj_06)
   deleted: (pred_3 obj_04 obj_05) (pred_4 obj_13 obj_06)
   added: (pred_1 obj_13 obj_04 obj_06)
   goals met: 2 of 3
10. (op_1 obj_13 obj_05 obj_09)
   deleted: (pred_2 obj_13 obj_05)
   added: (pred_2 obj_13 obj_09)
   goals met: 2 of 3
11. (op_2 obj_13 obj_04 obj_09 obj_06)
   deleted: (pred_1 obj_13 obj_04 obj_06)
   added: (pred_3 obj_04 obj_09) (pred_4 obj_13 obj_06)
   goals met: 3 of 3
